//Од стандарден влез се внесуваат два цели броја N и Х.123Да се најде најблискот број помал од N коj е тотално различен од бројот Х.Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
#include <stdio.h>
int main ()
{
    int n, x, temp, x1, k;
    scanf("%d %d", &n, &x);
    n--;
    while(n>=0){
        x1=x;
        k=1;
        while(x1>0)
        {
            temp=n;
            while(temp>0)
            {
                if(temp%10==x1%10)
                {
                    k=0;
                }
                temp=temp/10;
            }
            if(k==0) break;
            x1=x1/10;
        }
        if(k) {printf("%d", n); break;}
        n--;

    }
}