//Од стандарден влез се читаат непознат број на хексадецимални цифри се додека не се внесе точка (.). Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри. Доколку добиениот декаден збир е делив со 16 се печати Pogodok. Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 (последните цифри му се 1 и 6), се печати Poln pogodok инаку се печати самиот збир.

#include <stdio.h>
int main(){
    int broj, sum = 0;
    while(scanf("%x", &broj)){
        sum += broj;
    }
    if(sum % 16 == 0){
        if(sum % 100 == 16){
            printf("Poln pogodok");
        }else{
            printf("Pogodok");
        }
    }else{
        printf("%d", sum);
    }

}
