//Од тастатура се внесува цел број n, а потоа и n тројки природни броеви
//(должини на три отсечки). За секоја тројка должини треба да се испечати
//порака Moze ако со нив може да се конструира триаголник, во спротивно се
//печати Ne moze. На крај да се испечати редниот број на тројката броеви со која
//се конструира триаголникот со најголем периметар (се земаат предвид само
//тројките со кои може да се конструира триаголник), како и вредноста на
//најголемиот периметар. Ако постојат повеќе такви тројки броеви, да се
//испечати редниот број на последната. Се смета дека првата внесена тројка е со
//реден број еден, втората со реден број два итн.


#include <stdio.h>
int checkTriagolnik(int a, int b, int c){
    if( (a+b>c) && (b+c>a) && (a+c>b) ){
        return 1;
    }else{
        return 0;
    }
}
int main(){
    int o1,o2,o3, br_trojki, maxL = 0, maxIndex, i, l = 0;
    scanf("%d", &br_trojki);
    for(i = 1; i<= br_trojki;i++){
        scanf("%d %d %d", &o1, &o2, &o3);
        if(checkTriagolnik(o1,o2,o3)){
            printf("Moze\n");
            l = o1 + o2 + o3;
            if(l > maxL){
                maxL = l;
                maxIndex = i;
            }
        }else{
            printf("Ne moze\n");
        }

    }
    printf("Najgolem perimetar: %d, reden broj %d", maxL, maxIndex);
    return 0;
}