//Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <stdio.h>

int main(){
    int a,b,count=1;
    scanf("%d %d", &a, &b);
    if((a <= 0) || (b <= 0)){
        printf("Invalid input");
    }else{
        if(b > a){
            int temp = b;
            b = a;
            a = temp;
        }
        while(a != 0){
            if(count % 2 == 0){
                if(b%10 == a%10){
                    b /= 10;
                }else{
                    break;
                }
            }
            a /= 10;
            count++;
        }
        if(a > 0){
            printf("NE");
        }else{
            printf("PAREN");
        }
    }
    return 0;
}